CybersecurityUnitn/PISTIS/BSL/IAR_BSL_Source/IAR_v5_MSP430F552x_USB/BSL_Device_File.h
 *  b.	Governing Language.  This Agreement is written and executed in the English language.  If a translation of this Agreement is required for any purpose, including but not limited to registration of the Agreement pursuant to any governmental laws, regulations or rules, you shall be solely responsible for creating such translation.  Any translation of this Agreement into a language other than English is intended solely in order to comply with such laws or for reference purposes, and the English language version shall be authoritative and controlling.
 *  
 *  c.	Export Control.
 *  
 *  i.	Diversions of Technology.  You hereby agree that unless prior authorization is obtained from the U.S. Department of Commerce, neither you nor your subsidiaries or affiliates shall knowingly export, re-export, or release, directly or indirectly, any technology, software, or software source code (as defined in Part 772 of the Export Administration Regulations of the U.S. Department of Commerce ("EAR")), received from TI or any of its affiliated companies, or export, directly or indirectly, any direct product of such technology, software, or software source code (as defined in Part 734 of the EAR), to any destination or country to which the export, re-export, or release of the technology, software, software source code, or direct product is prohibited by the EAR.
 *  
 *  ii.	Assurance of Compliance.  You understand and acknowledge that products, technology (regardless of the form in which it is provided), software or software source code, received from TI or any of its affiliates under this Agreement may be under export control of the United States or other countries.  You shall comply with the United States and other applicable non-U.S. laws and regulations governing the export, re-export and release of any products, technology, software, or software source code received under this Agreement from TI or its affiliates.  You shall not undertake any action that is prohibited by the EAR.  Without limiting the generality of the foregoing, you specifically agree that you shall not transfer or release products, technology, software, or software source code of TI or its affiliates to, or for use by, military end users or for use in military, missile, nuclear, biological, or chemical weapons end uses.
 *  	
 *  iii.  Licenses.  Each party shall secure at its own expense, such licenses and export and import documents as are necessary for each respective party to fulfill its obligations under this Agreement.  If such licenses or government approvals cannot be obtained, TI may terminate this Agreement, or shall otherwise be excused from the performance of any obligations it may have under this Agreement for which the licenses or government approvals are required.
 *  
 *  13.	Entire Agreement.  This is the entire Agreement between you and TI and this Agreement supersedes any prior agreement between the parties related to the subject matter of this Agreement.  Notwithstanding the foregoing, any signed and effective software license agreement relating to the subject matter hereof and stating expressly that such agreement shall control regardless of any subsequent click-wrap, shrink-wrap or web-wrap, shall supersede the terms of this Agreement.  No amendment or modification of this Agreement will be effective unless in writing and signed by a duly authorized representative of TI.  You hereby warrant and represent that you have obtained all authorizations and other applicable consents required empowering you to enter into this Agreement.
 *  
 * --/COPYRIGHT--*/
#include "msp430x552x.h"
// Vendor ID (VID) for device, TI (MSP430)=0x2047
//    You can use is only in this example.
//    You can order your own VID at www.usb.org
#define USB_VID 0x2047         // Vendor ID, 0x2047 for Texas Instruments Incorporated (MSP430 Group)

#define USB_PID 0x0200         // Product ID (PID), 0x0200 for F552x HID BSL stack

// The following defines are here so that the supported crystals can be
// both easily seen, and changed without having to recompute any TBCCR6 values
// When changing these values, be sure to also change the matching SPEED_x_PLL values
// NOTE: Speeds must be in order from highest to lowest!
// NOTE: If only one external frequency is used,
//       all SPEED_x_PLL values must be changed to that value!

//24MHz will be detected
#define SPEED_1          24000000
#define SPEED_1_PLL      USBPLL_SETCLK_24_0;

//12MHz will be detected
#define SPEED_2          12000000
#define SPEED_2_PLL      USBPLL_SETCLK_12_0;

//8MHz will be detected
#define SPEED_3          8000000
#define SPEED_3_PLL      USBPLL_SETCLK_8_0;

//4MHz will be detected
#define SPEED_4          4000000
#define SPEED_4_PLL      USBPLL_SETCLK_4_0;

//Device Specific Definitions
#define MASS_ERASE_DELAY 0x8000
#define INTERRUPT_VECTOR_START 0xFFE0
#define INTERRUPT_VECTOR_END   0xFFFF
#define SECURE_RAM_START 0x2400

//******************* CHANGE BASED ON RAM/FLASH
#define DCO_SPEED 8000000
#define ACLK_SPEED 32768

#define TIMER_CTL           TBCTL
#define TIMER_CTL_SETTINGS  TBSSEL_2 + MC_2
#define TIMER_CTL_CLR       TBCLR

#define TIMER_CCTL          TBCCTL6
#define TIMER_CCTL_SETTINGS CM_1 + CCIS_1+ CAP
#define TIMER_CCTL_IFG      CCIFG
#define TIMER_CCTL_CM       CM_1

#define TIMER_CCR           TBCCR6

#define XT2SEL_PORT         P5SEL
#define XT2SEL_PINS         (BIT2 + BIT3)

//Device Specific Definitions
#define SMALL_ZAREA       // Just use 8Bytes for zArea

#define EXCLUDE_LOW_LEVEL_INIT // Exclude low_level_init for USB BSL

//Device Specific Definitions for commands and bugs
#define RAM_WRITE_ONLY_BSL 0x80
//#define FULL_FLASH_BSL
//#define RAM_BASED_BSL      1

#define DO_NOT_CHECK_VPE
#define USBKEYPID_STARTUP_BUGFIX
#define LOCK_USB_LEGACY

// standard command includes
#ifdef RAM_WRITE_ONLY_BSL
 #define SUPPORTS_RX_DATA_BLOCK_FAST
 #define SUPPORTS_RX_PASSWORD
 #define SUPPORTS_LOAD_PC
#endif

#ifdef FULL_FLASH_BSL
 #define FULL_GENERIC_COMMANDS
 #define FLASH_COMMANDS
#endif

#ifdef FULL_FRAM_BSL
 #define FULL_GENERIC_COMMANDS
#endif

#ifdef FULL_GENERIC_COMMANDS
 #define SUPPORTS_RX_DATA_BLOCK_FAST
 #define SUPPORTS_RX_PASSWORD
 #define SUPPORTS_LOAD_PC
 #define SUPPORTS_RX_DATA_BLOCK
 #define SUPPORTS_MASS_ERASE
 #define SUPPORTS_CRC_CHECK
 #define SUPPORTS_TX_DATA_BLOCK
 #define SUPPORTS_TX_BSL_VERSION
#endif

#ifdef FLASH_COMMANDS
 #define SUPPORTS_ERASE_SEGMENT
 #define SUPPORTS_TOGGLE_INFO
#endif
